app/Controllers/Cart.php

            $this->builder->select('keranjang.*, produk.*');
            $this->builder->join('produk', 'produk.id = keranjang.id_produk');
            $this->builder->where('pembuat', user()->id);
            $this->builder->orderBy('keranjang.created_at', 'DESC');
---
SELECT `keranjang`.*, `produk`.*
FROM `keranjang`
JOIN `produk` ON `produk`.`id` = `keranjang`.`id_produk`
WHERE `pembuat` = '1'
ORDER BY `keranjang`.`created_at` DESC