app/Controllers/Order.php

SELECT `produk`.*
FROM `produk`
WHERE `produk`.`id` = '8'
---
    public function konfirmasi($id = false)
    {
        $this->builder->select('produk.*');
        $this->builder->where('produk.id', $id);
        $query = $this->builder->get();

SELECT `produk`.*
FROM `produk`
WHERE `produk`.`id` = '8'
---
    public function order($id = false)
    {
        $this->builder->select('produk.*');
        $this->builder->where('produk.id', $id);
        $query = $this->builder->get();

INSERT INTO `transaksi` (`id_user`, `jumlah_barang`, `total_harga`, `status`, `token`, `created_at`, `updated_at`, `id`) VALUES ('1', 1, 305000, '', '0c8208b9-f5aa-4055-bcfb-6f2696e17dc3', '2024-01-11 03:57:03', '2024-01-11 03:57:03', '24011142')
UPDATE `transaksi` SET `id_user` = '1', `jumlah_barang` = 1, `total_harga` = 305000, `status` = '', `token` = '00e935ca-4f13-477b-9318-8cb73d65ed1c', `updated_at` = '2024-01-11 03:57:12'
WHERE `transaksi`.`id` IN ('24011142')
INSERT INTO `detail_transaksi` (`id_transaksi`, `id_produk`, `id_user`, `jumlah`, `harga`, `tanggal_keperluan`, `created_at`, `updated_at`) VALUES ('24011142', '8', '1', 1, 305000, NULL, '2024-01-11 03:57:03', '2024-01-11 03:57:03')
---

        $snapToken = \Midtrans\Snap::getSnapToken($params);

        $this->transaksiModel->save([
            'id' => $id_order,
            'id_user' => user()->id,
            'jumlah_barang' => 1,
            'total_harga' => $harga_produk,
            'status' => '',
            'token' => $snapToken
        ]);

        $transaksi_order_id = $this->transaksiModel->getInsertID();

        $this->detailTransaksiModel->save([
            'id_transaksi' => $id_order,
            'id_produk' => $id,
            'id_user' => user()->id,
            'jumlah' => 1,
            'harga' => $harga_produk,
            'tanggal_keperluan' => $tanggal_keperluan
        ]);