app/Controllers/Produk.php

    public function detail($id = false)
    {
        $this->builder->select('produk.*, supplier.nama_supplier');
        $this->builder->join('supplier', 'supplier.id = produk.id_supplier');
        $this->builder->where('produk.id', $id);
        $query = $this->builder->get();

        $this->builder->select('produk.*, supplier.nama_supplier, keranjang.id_produk, jumlah, keranjang.id AS keranjang_id');
        $this->builder->join('supplier', 'supplier.id = produk.id_supplier');
        $this->builder->join('keranjang', 'keranjang.id_produk = produk.id');
        $this->builder->where('produk.id', $id);
        $query2 = $this->builder->get();
---
SELECT `produk`.*, `supplier`.`nama_supplier`
FROM `produk`
JOIN `supplier` ON `supplier`.`id` = `produk`.`id_supplier`
WHERE `produk`.`id` = '8'
SELECT `produk`.*, `supplier`.`nama_supplier`, `keranjang`.`id_produk`, `jumlah`, `keranjang`.`id` AS `keranjang_id`
FROM `produk`
JOIN `supplier` ON `supplier`.`id` = `produk`.`id_supplier`
JOIN `keranjang` ON `keranjang`.`id_produk` = `produk`.`id`
WHERE `produk`.`id` = '8'