app/Models/BookingModel.php

SELECT COUNT(*) AS `numrows`
FROM `booking`
WHERE `pembuat` = '1'
AND YEAR(booking.created_at) = '2024'
---
    public function getCountBooking($id = false)
    {
        if ($id == false) {
            return $this->countAllResults();
        }

        return $this->where(['pembuat' => $id])->where('YEAR(booking.created_at)', date('Y'))->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `booking`
WHERE `pembuat` = '1'
AND YEAR(booking.created_at) = 2023
---
    public function getCountLastBooking($id = false)
    {
        if ($id == false) {
            return $this->countAllResults();
        }

        return $this->where(['pembuat' => $id])->where('YEAR(booking.created_at)', date('Y') - 1)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `booking`
---
    public function getCountBookingAll($id = false)
    {

        return $this->countAllResults();