app/Models/CartModel.php

SELECT `keranjang`.*, `produk`.`nama`, `produk`.`gambar`, `produk`.`harga`, `produk`.`stok`
FROM `keranjang`
JOIN `produk` ON `produk`.`id` = `keranjang`.`id_produk`
WHERE `pembuat` = '4'
ORDER BY `keranjang`.`created_at` ASC
---
    public function getCart($id = false)
    {
        if ($id == false) {
            return $this->join('produk', 'produk.id = keranjang.id_produk')->select('keranjang.*,produk.nama,produk.gambar,produk.harga,produk.stok')->where(['pembuat' => user_id()])->orderBy('keranjang.created_at', 'ASC')->findAll();