app/Models/DetailTransaksiModel.php

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
JOIN `transaksi` ON `transaksi`.`id` = `detail_transaksi`.`id_transaksi`
WHERE `detail_transaksi`.`id_user` = '1'
AND `id_kategori` = 1
AND YEAR(transaksi.created_at) = '2024'
---
    public function getCountProduk($id = false)
    {
        if ($id == false) {
            return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 1])->countAllResults();
        }

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->join('transaksi', 'transaksi.id = detail_transaksi.id_transaksi')->where(['detail_transaksi.id_user' => $id])->where(['id_kategori' => 1])->where('YEAR(transaksi.created_at)', date('Y'))->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
JOIN `transaksi` ON `transaksi`.`id` = `detail_transaksi`.`id_transaksi`
WHERE `detail_transaksi`.`id_user` = '1'
AND `id_kategori` = 1
AND YEAR(transaksi.created_at) = 2023
---
    public function getCountLastProduk($id = false)
    {
        if ($id == false) {
            return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 1])->countAllResults();
        }

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->join('transaksi', 'transaksi.id = detail_transaksi.id_transaksi')->where(['detail_transaksi.id_user' => $id])->where(['id_kategori' => 1])->where('YEAR(transaksi.created_at)', date('Y') - 1)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
JOIN `transaksi` ON `transaksi`.`id` = `detail_transaksi`.`id_transaksi`
WHERE `detail_transaksi`.`id_user` = '1'
AND `id_kategori` = 2
AND YEAR(transaksi.created_at) = '2024'
---
    public function getCountWedding($id = false)
    {
        if ($id == false) {
            return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 2])->countAllResults();
        }

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->join('transaksi', 'transaksi.id = detail_transaksi.id_transaksi')->where(['detail_transaksi.id_user' => $id])->where(['id_kategori' => 2])->where('YEAR(transaksi.created_at)', date('Y'))->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
JOIN `transaksi` ON `transaksi`.`id` = `detail_transaksi`.`id_transaksi`
WHERE `detail_transaksi`.`id_user` = '1'
AND `id_kategori` = 2
AND YEAR(transaksi.created_at) = 2023
---
    public function getCountLastWedding($id = false)
    {
        if ($id == false) {
            return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 2])->countAllResults();
        }

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->join('transaksi', 'transaksi.id = detail_transaksi.id_transaksi')->where(['detail_transaksi.id_user' => $id])->where(['id_kategori' => 2])->where('YEAR(transaksi.created_at)', date('Y') - 1)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
JOIN `transaksi` ON `transaksi`.`id` = `detail_transaksi`.`id_transaksi`
WHERE `detail_transaksi`.`id_user` = '1'
AND `id_kategori` = 3
AND YEAR(transaksi.created_at) = '2024'
---
    public function getCountGraduation($id = false)
    {
        if ($id == false) {
            return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 3])->countAllResults();
        }

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->join('transaksi', 'transaksi.id = detail_transaksi.id_transaksi')->where(['detail_transaksi.id_user' => $id])->where(['id_kategori' => 3])->where('YEAR(transaksi.created_at)', date('Y'))->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
JOIN `transaksi` ON `transaksi`.`id` = `detail_transaksi`.`id_transaksi`
WHERE `detail_transaksi`.`id_user` = '1'
AND `id_kategori` = 3
AND YEAR(transaksi.created_at) = 2023
---
    public function getCountLastGraduation($id = false)
    {
        if ($id == false) {
            return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 3])->countAllResults();
        }

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->join('transaksi', 'transaksi.id = detail_transaksi.id_transaksi')->where(['detail_transaksi.id_user' => $id])->where(['id_kategori' => 3])->where('YEAR(transaksi.created_at)', date('Y') - 1)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
WHERE `id_kategori` = 1
---
    public function getCountProdukAll($id = false)
    {

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 1])->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
WHERE `id_kategori` = 2
---
    public function getCountWeddingAll($id = false)
    {

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 2])->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `detail_transaksi`
JOIN `produk` ON `produk`.`id` = `detail_transaksi`.`id_produk`
WHERE `id_kategori` = 3
---
    public function getCountGraduationAll($id = false)
    {

        return $this->join('produk', 'produk.id = detail_transaksi.id_produk')->where(['id_kategori' => 3])->countAllResults();