app/Models/KategoriModel.php

    public function getKategori($id = false)
    {
        if ($id == false) {
            return $this->orderBy('id')->findAll();
---
SELECT *
FROM `kategori`
ORDER BY `id`

    public function getCountKategori($id = false)
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kategori`