app/Models/LayananModel.php

    public function getCountLayanan($id = false)
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `layanan`