app/Models/ProdukModel.php

    public function getTotalStok($id = false)
    {
        return $this->selectSum('stok')->where('id_kategori', 1)->first();
---
SELECT SUM(`stok`) AS `stok`
FROM `produk`
WHERE `id_kategori` = 1
 LIMIT 1

    public function getTotalStokProduk($id = false)
    {
        return $this->where('id_kategori', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `id_kategori` = 1

    public function getCountProduk($id = false)
    {
        return $this->where('id_kategori', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `id_kategori` = 1

    public function getCountJasa($id = false)
    {
        return $this->where('id_kategori', 2)->orWhere('id_kategori', 3)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
WHERE `id_kategori` = 2
OR `id_kategori` = 3