app/Models/SupplierModel.php

    public function getCountSupplier($id = false)
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `supplier`