app/Models/TransaksiModel.php

    public function getMaxTransaksi($id = false)
    {
        return $this->selectMax('id')->first();
---
SELECT MAX(`id`) AS `id`
FROM `transaksi`
 LIMIT 1

    public function getCountTransaksi($id = false)
    {
        if ($id == false) {
            return $this->countAllResults();
        }

        return $this->where('id_user', $id)->where('YEAR(transaksi.created_at)', date('Y'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `id_user` = '1'
AND YEAR(transaksi.created_at) = '2024'

    public function getCountLastTransaksi($id = false)
    {
        if ($id == false) {
            return $this->countAllResults();
        }

        return $this->where('id_user', $id)->where('YEAR(transaksi.created_at)', date('Y') - 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `id_user` = '1'
AND YEAR(transaksi.created_at) = 2023

    public function getTotalHargaTransaksi($id = false)
    {
        return $this->selectSum('total_harga')->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
 LIMIT 1

    public function getPenghasilan2017($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', 2017)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2017
 LIMIT 1

    public function getPenghasilan2018($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', 2018)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2018
 LIMIT 1

    public function getPenghasilan2019($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', 2019)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2019
 LIMIT 1

    public function getPenghasilan2020($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', 2020)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2020
 LIMIT 1

    public function getPenghasilan2021($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', 2021)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2021
 LIMIT 1

    public function getPenghasilan2022($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', 2022)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2022
 LIMIT 1

    public function getPenghasilan2023($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', 2023)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2023
 LIMIT 1

    public function getPenghasilan2024($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', date('Y') + 1)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2025
 LIMIT 1

    public function getPenghasilan2025($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', date('Y') + 2)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2026
 LIMIT 1

    public function getPenghasilan2026($id = false)
    {
        return $this->selectSum('total_harga')->where('YEAR(transaksi.created_at)', date('Y') + 3)->first();
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE YEAR(transaksi.created_at) = 2027
 LIMIT 1

    public function getPenghasilanMax($id = false)
    {
        // $total = max($this->selectSum('total_harga')->groupBy('YEAR(transaksi.created_at)')->findAll());
        return max($this->selectSum('total_harga')->groupBy('YEAR(transaksi.created_at)')->findAll());
---
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
GROUP BY YEAR(transaksi.created_at)