app/Models/UsersModel.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function getCountUsers()
    {
        return $this->countAllResults();